{"last_updated":"2024-12-11T13:21:16Z","teams":[{"notes":[{"external_link":true,"info_message":"Bukayo Saka, Kai Havertz, Martin Odegaard and Fabio Vieira all scored spot-kicks in the first half of 2023/24. Mikel Arteta later said that the players decide themselves on the pitch who takes penalties.","source_link":""},{"external_link":true,"info_message":"Saka took the last four penalties of 2023/24, suggesting he's first in line.","source_link":""}],"id":1},{"notes":[{"external_link":true,"info_message":"Douglas Luiz was on penalties in 2023/24 but has now left the club.","source_link":""},{"external_link":true,"info_message":"Youri Tielemans took and missed Aston Villa's first spot-kick of 2024/25 in Gameweek 12. Ollie Watkins then took and scored one in Gameweek 14.","source_link":""},{"external_link":true,"info_message":"Ollie Watkins had previously taken two penalties in 2022/23, missing one.","source_link":""}],"id":2},{"notes":[{"external_link":true,"info_message":"Dominic Solanke took all of Bournemouth's penalties in 2023/24. He has since left the club.","source_link":""},{"external_link":true,"info_message":"Evanilson took - and missed - Bournemouth's first spot-kick of 2024/25. Justin Kluivert then took the second after manager Andoni Iraola confirmed the two players were his two takers.","source_link":""},{"external_link":true,"info_message":"Justin Kluivert stepped up to take a spot-kick for Bournemouth in pre-season.","source_link":""}],"id":3},{"notes":[{"external_link":true,"info_message":"Bryan Mbeumo has filled in for hitherto first-choice penalty taker Ivan Toney in each of the last three seasons.","source_link":""},{"external_link":true,"info_message":"Yoane Wissa took a penalty for Brentford in pre-season with both Mbeumo and Toney absent.","source_link":""}],"id":4},{"notes":[],"id":5},{"notes":[{"external_link":true,"info_message":"Enzo Maresca has confirmed that Cole Palmer, who scored nine penalties in 2023/24, remains first-choice taker.","source_link":""},{"external_link":true,"info_message":"Enzo Fernandes deputised on penalties in 2023/24 but Christopher Nkunku and Noni Madueke scored from the spot in pre-season. Madueke had also found the net from a penalty in 2023/24 with Enzo and Palmer absent.","source_link":""}],"id":6},{"notes":[{"external_link":true,"info_message":"Eberechi Eze stepped up to score against Everton in November 2023 and was absent when Jean-Philippe Mateta converted two spot-kicks later in the season.","source_link":""}],"id":7},{"notes":[{"external_link":true,"info_message":"Dominic Calvert-Lewin had started 2021/22 as Everton's first-choice penalty-taker, with the now-departed Richarlison assuming responsibility later in the season. Calvert-Lewin resumed taking them in 2022/23 after the Brazilian left.","source_link":""}],"id":8},{"notes":[{"external_link":true,"info_message":"Willian took both of Fulham’s penalties last season but has now left the club. Saka Lukic took one in pre-season but Andreas Pereira, who was absent when Lukic netted, scored from the spot in 2022/23.","source_link":""},{"external_link":true,"info_message":"Raul Jimenez took a penalty in the EFL Cup tie against Birmingham in August 2024 but Pereira and Lukic weren't on the field.","source_link":""}],"id":9},{"notes":[{"external_link":true,"info_message":"George Hirst and Ali Al Hamadi had both scored penalties in 2023/24 with each other off the pitch. Nathan Broadhead had netted two in the previous campaign.","source_link":""}],"id":10},{"notes":[],"id":11},{"notes":[],"id":12},{"notes":[],"id":13},{"notes":[],"id":14},{"notes":[{"external_link":true,"info_message":"Alexander Isak and Callum Wilson have been sharing penalty-taking responsibilities for Newcastle United, though neither of them had been on the same pitch for a spot-kick until Double Gameweek 36 of 2022/23. It was Wilson who then scored two penalties with both players on the field. A year later, Isak stepped up against Burnley with Wilson on the field and missed.","source_link":""},{"external_link":true,"info_message":"Anthony Gordon took a penalty with both Isak and Wilson absent in Gameweek 25 of 2023/24.","source_link":""}],"id":15},{"notes":[],"id":16},{"notes":[{"external_link":true,"info_message":"Cameron Archer took and missed a penalty in Gameweek 4 when regular taker Adam Armstrong was benched.","source_link":""}],"id":17},{"notes":[{"external_link":true,"info_message":"Ange Postecoglou said in August 2023 that Son Heung-min, James Maddison and Richarlison were all in the mix for penalty-taking duties. Son took both penalties later that season but Dominic Solanke has since joined the club.","source_link":""}],"id":18},{"notes":[],"id":19},{"notes":[{"external_link":true,"info_message":"Matheus Cunha, Hwang Hee-chan and Pablo Sarabia (twice) all scored penalties last season. Sarabia and Hwang weren’t on the field when one of their teammates took one but Cunha was playing when Hwang stepped up and Sarabia scored one of his two.","source_link":""}],"id":20}]}